avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* CLKCTRL.MCLKCTRLB  bit masks and bit positions */
#define CLKCTRL_PEN_bm  0x01  /* Prescaler enable bit mask. */
#define CLKCTRL_PEN_bp  0  /* Prescaler enable bit position. */
#define CLKCTRL_PDIV_gm  0x1E  /* Prescaler division group mask. */
#define CLKCTRL_PDIV_gp  1  /* Prescaler division group position. */
#define CLKCTRL_PDIV_0_bm  (1<<1)  /* Prescaler division bit 0 mask. */
#define CLKCTRL_PDIV_0_bp  1  /* Prescaler division bit 0 position. */
#define CLKCTRL_PDIV_1_bm  (1<<2)  /* Prescaler division bit 1 mask. */
#define CLKCTRL_PDIV_1_bp  2  /* Prescaler division bit 1 position. */
#define CLKCTRL_PDIV_2_bm  (1<<3)  /* Prescaler division bit 2 mask. */
#define CLKCTRL_PDIV_2_bp  3  /* Prescaler division bit 2 position. */
#define CLKCTRL_PDIV_3_bm  (1<<4)  /* Prescaler division bit 3 mask. */
#define CLKCTRL_PDIV_3_bp  4  /* Prescaler division bit 3 position. */

/* CLKCTRL.MCLKCTRLC  bit masks and bit positions */
#define CLKCTRL_CFD0_bm  0x01  /* Clock Failure Inject 0 bit mask. */
#define CLKCTRL_CFD0_bp  0  /* Clock Failure Inject 0 bit position. */
#define CLKCTRL_CFD1_bm  0x02  /* Clock Failure Inject 1 bit mask. */
#define CLKCTRL_CFD1_bp  1  /* Clock Failure Inject 1 bit position. */

/* CLKCTRL.MCLKINTCTRL  bit masks and bit positions */
/* CLKCTRL_CFD0  is already defined. */
/* CLKCTRL_CFD1  is already defined. */
#define CLKCTRL_CFM0_bm  0x04  /* Clock Measurement Failure Detected 0 bit mask. */
#define CLKCTRL_CFM0_bp  2  /* Clock Measurement Failure Detected 0 bit position. */
#define CLKCTRL_CFM1_bm  0x08  /* Clock Measurement Failure Detected 1 bit mask. */
#define CLKCTRL_CFM1_bp  3  /* Clock Measurement Failure Detected 1 bit position. */
#define CLKCTRL_CFMD0_bm  0x10  /* Clock Measurement Done 0 bit mask. */
#define CLKCTRL_CFMD0_bp  4  /* Clock Measurement Done 0 bit position. */
#define CLKCTRL_CFMD1_bm  0x20  /* Clock Measurement Done 1 bit mask. */
#define CLKCTRL_CFMD1_bp  5  /* Clock Measurement Done 1 bit position. */

/* CLKCTRL.MCLKINTFLAGS  bit masks and bit positions */
/* CLKCTRL_CFD0  is already defined. */
/* CLKCTRL_CFD1  is already defined. */
/* CLKCTRL_CFM0  is already defined. */
/* CLKCTRL_CFM1  is already defined. */
/* CLKCTRL_CFMD0  is already defined. */
/* CLKCTRL_CFMD1  is already defined. */

/* CLKCTRL.MCLKSTATUS  bit masks and bit positions */
#define CLKCTRL_SOSC_bm  0x01  /* System Oscillator Changing bit mask. */
#define CLKCTRL_SOSC_bp  0  /* System Oscillator Changing bit position. */
#define CLKCTRL_OSCHFS_bm  0x02  /* High Frequency Oscillator Status bit mask. */
#define CLKCTRL_OSCHFS_bp  1  /* High Frequency Oscillator Status bit position. */
#define CLKCTRL_OSC32KS_bm  0x04  /* 32KHz Oscillator Status bit mask. */
#define CLKCTRL_OSC32KS_bp  2  /* 32KHz Oscillator Status bit position. */
#define CLKCTRL_XOSC32KS_bm  0x08  /* 32.768 kHz Crystal Oscillator Status bit mask. */
#define CLKCTRL_XOSC32KS_bp  3  /* 32.768 kHz Crystal Oscillator Status bit position. */
#define CLKCTRL_EXTS_bm  0x10  /* External Clock Status bit mask. */
#define CLKCTRL_EXTS_bp  4  /* External Clock Status bit position. */
#define CLKCTRL_PLLS_bm  0x20  /* PLL Oscillator Status bit mask. */
#define CLKCTRL_PLLS_bp  5  /* PLL Oscillator Status bit position. */

/* CLKCTRL.MCLKTIMEBASE  bit masks and bit positions */
#define CLKCTRL_TIMEBASE_gm  0x1F  /* Timebase group mask. */
#define CLKCTRL_TIMEBASE_gp  0  /* Timebase group position. */
#define CLKCTRL_TIMEBASE_0_bm  (1<<0)  /* Timebase bit 0 mask. */
#define CLKCTRL_TIMEBASE_0_bp  0  /* Timebase bit 0 position. */
#define CLKCTRL_TIMEBASE_1_bm  (1<<1)  /* Timebase bit 1 mask. */
#define CLKCTRL_TIMEBASE_1_bp  1  /* Timebase bit 1 position. */
#define CLKCTRL_TIMEBASE_2_bm  (1<<2)  /* Timebase bit 2 mask. */
#define CLKCTRL_TIMEBASE_2_bp  2  /* Timebase bit 2 position. */
#define CLKCTRL_TIMEBASE_3_bm  (1<<3)  /* Timebase bit 3 mask. */
#define CLKCTRL_TIMEBASE_3_bp  3  /* Timebase bit 3 position. */
#define CLKCTRL_TIMEBASE_4_bm  (1<<4)  /* Timebase bit 4 mask. */
#define CLKCTRL_TIMEBASE_4_bp  4  /* Timebase bit 4 position. */

/* CLKCTRL.MCLKCFD0CTRLA  bit masks and bit positions */
#define CLKCTRL_CFDEN_bm  0x01  /* Clock Failure Detect Enable bit mask. */
#define CLKCTRL_CFDEN_bp  0  /* Clock Failure Detect Enable bit position. */
#define CLKCTRL_CFDREF_gm  0x06  /* Clock Failure Detect Reference group mask. */
#define CLKCTRL_CFDREF_gp  1  /* Clock Failure Detect Reference group position. */
#define CLKCTRL_CFDREF_0_bm  (1<<1)  /* Clock Failure Detect Reference bit 0 mask. */
#define CLKCTRL_CFDREF_0_bp  1  /* Clock Failure Detect Reference bit 0 position. */
#define CLKCTRL_CFDREF_1_bm  (1<<2)  /* Clock Failure Detect Reference bit 1 mask. */
#define CLKCTRL_CFDREF_1_bp  2  /* Clock Failure Detect Reference bit 1 position. */
#define CLKCTRL_CFDSRC_gm  0x38  /* Clock Failure Detect Source group mask. */
#define CLKCTRL_CFDSRC_gp  3  /* Clock Failure Detect Source group position. */
#define CLKCTRL_CFDSRC_0_bm  (1<<3)  /* Clock Failure Detect Source bit 0 mask. */
#define CLKCTRL_CFDSRC_0_bp  3  /* Clock Failure Detect Source bit 0 position. */
#define CLKCTRL_CFDSRC_1_bm  (1<<4)  /* Clock Failure Detect Source bit 1 mask. */
#define CLKCTRL_CFDSRC_1_bp  4  /* Clock Failure Detect Source bit 1 position. */
#define CLKCTRL_CFDSRC_2_bm  (1<<5)  /* Clock Failure Detect Source bit 2 mask. */
#define CLKCTRL_CFDSRC_2_bp  5  /* Clock Failure Detect Source bit 2 position. */

/* CLKCTRL.MCLKCFD1CTRLA  bit masks and bit positions */
/* CLKCTRL_CFDEN  is already defined. */
/* CLKCTRL_CFDREF  is already defined. */
/* CLKCTRL_CFDSRC  is already defined. */

/* CLKCTRL.MCLKCFM0CTRLA  bit masks and bit positions */
#define CLKCTRL_MEN_bm  0x01  /* Measurement Enable bit mask. */
#define CLKCTRL_MEN_bp  0  /* Measurement Enable bit position. */
#define CLKCTRL_CFMSRC_gm  0x0E  /* CFM Clock Reference group mask. */
#define CLKCTRL_CFMSRC_gp  1  /* CFM Clock Reference group position. */
#define CLKCTRL_CFMSRC_0_bm  (1<<1)  /* CFM Clock Reference bit 0 mask. */
#define CLKCTRL_CFMSRC_0_bp  1  /* CFM Clock Reference bit 0 position. */
#define CLKCTRL_CFMSRC_1_bm  (1<<2)  /* CFM Clock Reference bit 1 mask. */
#define CLKCTRL_CFMSRC_1_bp  2  /* CFM Clock Reference bit 1 position. */
#define CLKCTRL_CFMSRC_2_bm  (1<<3)  /* CFM Clock Reference bit 2 mask. */
#define CLKCTRL_CFMSRC_2_bp  3  /* CFM Clock Reference bit 2 position. */
#define CLKCTRL_TYPE_bm  0x10  /* Measurement Type bit mask. */
#define CLKCTRL_TYPE_bp  4  /* Measurement Type bit position. */

/* CLKCTRL.MCLKCFM0CTRLB  bit masks and bit positions */
#define CLKCTRL_REFCEN_bm  0x01  /* Reference Clock Enable bit mask. */
#define CLKCTRL_REFCEN_bp  0  /* Reference Clock Enable bit position. */
#define CLKCTRL_CFMREF_gm  0x06  /* CFM Reference Source group mask. */
#define CLKCTRL_CFMREF_gp  1  /* CFM Reference Source group position. */
#define CLKCTRL_CFMREF_0_bm  (1<<1)  /* CFM Reference Source bit 0 mask. */
#define CLKCTRL_CFMREF_0_bp  1  /* CFM Reference Source bit 0 position. */
#define CLKCTRL_CFMREF_1_bm  (1<<2)  /* CFM Reference Source bit 1 mask. */
#define CLKCTRL_CFMREF_1_bp  2  /* CFM Reference Source bit 1 position. */

/* CLKCTRL.MCLKCFM1CTRLA  bit masks and bit positions */
/* CLKCTRL_MEN  is already defined. */
/* CLKCTRL_CFMSRC  is already defined. */
/* CLKCTRL_TYPE  is already defined. */

/* CLKCTRL.MCLKCFM1CTRLB  bit masks and bit positions */
/* CLKCTRL_REFCEN  is already defined. */
/* CLKCTRL_CFMREF  is already defined. */

/* CLKCTRL.OSCHFCTRLA  bit masks and bit positions */
#define CLKCTRL_AUTOTUNE_bm  0x01  /* Autotune bit mask. */
#define CLKCTRL_AUTOTUNE_bp  0  /* Autotune bit position. */
#define CLKCTRL_FRQSEL_gm  0x3C  /* Frequency select group mask. */
#define CLKCTRL_FRQSEL_gp  2  /* Frequency select group position. */
#define CLKCTRL_FRQSEL_0_bm  (1<<2)  /* Frequency select bit 0 mask. */
#define CLKCTRL_FRQSEL_0_bp  2  /* Frequency select bit 0 position. */
#define CLKCTRL_FRQSEL_1_bm  (1<<3)  /* Frequency select bit 1 mask. */
#define CLKCTRL_FRQSEL_1_bp  3  /* Frequency select bit 1 position. */
#define CLKCTRL_FRQSEL_2_bm  (1<<4)  /* Frequency select bit 2 mask. */
#define CLKCTRL_FRQSEL_2_bp  4  /* Frequency select bit 2 position. */
#define CLKCTRL_FRQSEL_3_bm  (1<<5)  /* Frequency select bit 3 mask. */
#define CLKCTRL_FRQSEL_3_bp  5  /* Frequency select bit 3 position. */
#define CLKCTRL_RUNSTDBY_bm  0x80  /* Run in Standby bit mask. */
#define CLKCTRL_RUNSTDBY_bp  7  /* Run in Standby bit position. */

/* CLKCTRL.OSCHFTUNE  bit masks and bit positions */
#define CLKCTRL_TUNE_gm  0xFF  /* Oscillator Tune group mask. */
#define CLKCTRL_TUNE_gp  0  /* Oscillator Tune group position. */
#define CLKCTRL_TUNE_0_bm  (1<<0)  /* Oscillator Tune bit 0 mask. */
#define CLKCTRL_TUNE_0_bp  0  /* Oscillator Tune bit 0 position. */
#define CLKCTRL_TUNE_1_bm  (1<<1)  /* Oscillator Tune bit 1 mask. */
#define CLKCTRL_TUNE_1_bp  1  /* Oscillator Tune bit 1 position. */
#define CLKCTRL_TUNE_2_bm  (1<<2)  /* Oscillator Tune bit 2 mask. */
#define CLKCTRL_TUNE_2_bp  2  /* Oscillator Tune bit 2 position. */
#define CLKCTRL_TUNE_3_bm  (1<<3)  /* Oscillator Tune bit 3 mask. */
#define CLKCTRL_TUNE_3_bp  3  /* Oscillator Tune bit 3 position. */
#define CLKCTRL_TUNE_4_bm  (1<<4)  /* Oscillator Tune bit 4 mask. */
#define CLKCTRL_TUNE_4_bp  4  /* Oscillator Tune bit 4 position. */
#define CLKCTRL_TUNE_5_bm  (1<<5)  /* Oscillator Tune bit 5 mask. */
#define CLKCTRL_TUNE_5_bp  5  /* Oscillator Tune bit 5 position. */
#define CLKCTRL_TUNE_6_bm  (1<<6)  /* Oscillator Tune bit 6 mask. */
#define CLKCTRL_TUNE_6_bp  6  /* Oscillator Tune bit 6 position. */
#define CLKCTRL_TUNE_7_bm  (1<<7)  /* Oscillator Tune bit 7 mask. */
#define CLKCTRL_TUNE_7_bp  7  /* Oscillator Tune bit 7 position. */

/* CLKCTRL.PLLCTRLA  bit masks and bit positions */
#define CLKCTRL_MULFAC_gm  0x03  /* Multiplication Factor group mask. */
#define CLKCTRL_MULFAC_gp  0  /* Multiplication Factor group position. */
#define CLKCTRL_MULFAC_0_bm  (1<<0)  /* Multiplication Factor bit 0 mask. */
#define CLKCTRL_MULFAC_0_bp  0  /* Multiplication Factor bit 0 position. */
#define CLKCTRL_MULFAC_1_bm  (1<<1)  /* Multiplication Factor bit 1 mask. */
#define CLKCTRL_MULFAC_1_bp  1  /* Multiplication Factor bit 1 position. */
#define CLKCTRL_SOURCE_bm  0x40  /* Source bit mask. */
#define CLKCTRL_SOURCE_bp  6  /* Source bit position. */
/* CLKCTRL_RUNSTDBY  is already defined. */

