avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* ERRCTRL.ESF  bit masks and bit positions */
#define ERRCTRL_ESF0_bm  0x01  /* Error Status Flag 0 bit mask. */
#define ERRCTRL_ESF0_bp  0  /* Error Status Flag 0 bit position. */
#define ERRCTRL_ESF1_bm  0x02  /* Error Status Flag 1 bit mask. */
#define ERRCTRL_ESF1_bp  1  /* Error Status Flag 1 bit position. */
#define ERRCTRL_ESF2_bm  0x04  /* Error Status Flag 2 bit mask. */
#define ERRCTRL_ESF2_bp  2  /* Error Status Flag 2 bit position. */
#define ERRCTRL_ESF3_bm  0x08  /* Error Status Flag 3 bit mask. */
#define ERRCTRL_ESF3_bp  3  /* Error Status Flag 3 bit position. */
#define ERRCTRL_ESF4_bm  0x10  /* Error Status Flag 4 bit mask. */
#define ERRCTRL_ESF4_bp  4  /* Error Status Flag 4 bit position. */
#define ERRCTRL_ESF5_bm  0x20  /* Error Status Flag 5 bit mask. */
#define ERRCTRL_ESF5_bp  5  /* Error Status Flag 5 bit position. */
#define ERRCTRL_ESF6_bm  0x40  /* Error Status Flag 6 bit mask. */
#define ERRCTRL_ESF6_bp  6  /* Error Status Flag 6 bit position. */
#define ERRCTRL_ESF7_bm  0x80  /* Error Status Flag 7 bit mask. */
#define ERRCTRL_ESF7_bp  7  /* Error Status Flag 7 bit position. */
#define ERRCTRL_ESF8_bm  0x100  /* Error Status Flag 8 bit mask. */
#define ERRCTRL_ESF8_bp  8  /* Error Status Flag 8 bit position. */
#define ERRCTRL_ESF9_bm  0x200  /* Error Status Flag 9 bit mask. */
#define ERRCTRL_ESF9_bp  9  /* Error Status Flag 9 bit position. */
#define ERRCTRL_ESF10_bm  0x400  /* Error Status Flag 10 bit mask. */
#define ERRCTRL_ESF10_bp  10  /* Error Status Flag 10 bit position. */
#define ERRCTRL_ESF11_bm  0x800  /* Error Status Flag 11 bit mask. */
#define ERRCTRL_ESF11_bp  11  /* Error Status Flag 11 bit position. */
#define ERRCTRL_ESF12_bm  0x1000  /* Error Status Flag 12 bit mask. */
#define ERRCTRL_ESF12_bp  12  /* Error Status Flag 12 bit position. */
#define ERRCTRL_ESF13_bm  0x2000  /* Error Status Flag 13 bit mask. */
#define ERRCTRL_ESF13_bp  13  /* Error Status Flag 13 bit position. */
#define ERRCTRL_ESF14_bm  0x4000  /* Error Status Flag 14 bit mask. */
#define ERRCTRL_ESF14_bp  14  /* Error Status Flag 14 bit position. */
#define ERRCTRL_ESF15_bm  0x8000  /* Error Status Flag 15 bit mask. */
#define ERRCTRL_ESF15_bp  15  /* Error Status Flag 15 bit position. */
#define ERRCTRL_ESF16_bm  0x10000  /* Error Status Flag 16 bit mask. */
#define ERRCTRL_ESF16_bp  16  /* Error Status Flag 16 bit position. */

/* ERRCTRL.ESFTEST  bit masks and bit positions */
#define ERRCTRL_ESFTEST0_bm  0x01  /* Error Status Flag Test Injection 0 bit mask. */
#define ERRCTRL_ESFTEST0_bp  0  /* Error Status Flag Test Injection 0 bit position. */
#define ERRCTRL_ESFTEST1_bm  0x02  /* Error Status Flag Test Injection 1 bit mask. */
#define ERRCTRL_ESFTEST1_bp  1  /* Error Status Flag Test Injection 1 bit position. */
#define ERRCTRL_ESFTEST2_bm  0x04  /* Error Status Flag Test Injection 2 bit mask. */
#define ERRCTRL_ESFTEST2_bp  2  /* Error Status Flag Test Injection 2 bit position. */
#define ERRCTRL_ESFTEST3_bm  0x08  /* Error Status Flag Test Injection 3 bit mask. */
#define ERRCTRL_ESFTEST3_bp  3  /* Error Status Flag Test Injection 3 bit position. */
#define ERRCTRL_ESFTEST4_bm  0x10  /* Error Status Flag Test Injection 4 bit mask. */
#define ERRCTRL_ESFTEST4_bp  4  /* Error Status Flag Test Injection 4 bit position. */
#define ERRCTRL_ESFTEST5_bm  0x20  /* Error Status Flag Test Injection 5 bit mask. */
#define ERRCTRL_ESFTEST5_bp  5  /* Error Status Flag Test Injection 5 bit position. */
#define ERRCTRL_ESFTEST6_bm  0x40  /* Error Status Flag Test Injection 6 bit mask. */
#define ERRCTRL_ESFTEST6_bp  6  /* Error Status Flag Test Injection 6 bit position. */
#define ERRCTRL_ESFTEST7_bm  0x80  /* Error Status Flag Test Injection 7 bit mask. */
#define ERRCTRL_ESFTEST7_bp  7  /* Error Status Flag Test Injection 7 bit position. */
#define ERRCTRL_ESFTEST8_bm  0x100  /* Error Status Flag Test Injection 8 bit mask. */
#define ERRCTRL_ESFTEST8_bp  8  /* Error Status Flag Test Injection 8 bit position. */
#define ERRCTRL_ESFTEST9_bm  0x200  /* Error Status Flag Test Injection 9 bit mask. */
#define ERRCTRL_ESFTEST9_bp  9  /* Error Status Flag Test Injection 9 bit position. */
#define ERRCTRL_ESFTEST10_bm  0x400  /* Error Status Flag Test Injection 10 bit mask. */
#define ERRCTRL_ESFTEST10_bp  10  /* Error Status Flag Test Injection 10 bit position. */
#define ERRCTRL_ESFTEST11_bm  0x800  /* Error Status Flag Test Injection 11 bit mask. */
#define ERRCTRL_ESFTEST11_bp  11  /* Error Status Flag Test Injection 11 bit position. */
#define ERRCTRL_ESFTEST12_bm  0x1000  /* Error Status Flag Test Injection 12 bit mask. */
#define ERRCTRL_ESFTEST12_bp  12  /* Error Status Flag Test Injection 12 bit position. */
#define ERRCTRL_ESFTEST13_bm  0x2000  /* Error Status Flag Test Injection 13 bit mask. */
#define ERRCTRL_ESFTEST13_bp  13  /* Error Status Flag Test Injection 13 bit position. */
#define ERRCTRL_ESFTEST14_bm  0x4000  /* Error Status Flag Test Injection 14 bit mask. */
#define ERRCTRL_ESFTEST14_bp  14  /* Error Status Flag Test Injection 14 bit position. */
#define ERRCTRL_ESFTEST15_bm  0x8000  /* Error Status Flag Test Injection 15 bit mask. */
#define ERRCTRL_ESFTEST15_bp  15  /* Error Status Flag Test Injection 15 bit position. */
#define ERRCTRL_ESFTEST16_bm  0x10000  /* Error Status Flag Test Injection 16 bit mask. */
#define ERRCTRL_ESFTEST16_bp  16  /* Error Status Flag Test Injection 16 bit position. */


/* EVSYS - Event System */
/* EVSYS.SWEVENTA  bit masks and bit positions */
#define EVSYS_CH0_bm  0x01  /* Channel 0 Select bit mask. */
#define EVSYS_CH0_bp  0  /* Channel 0 Select bit position. */
#define EVSYS_CH1_bm  0x02  /* Channel 1 Select bit mask. */
#define EVSYS_CH1_bp  1  /* Channel 1 Select bit position. */
#define EVSYS_CH2_bm  0x04  /* Channel 2 Select bit mask. */
#define EVSYS_CH2_bp  2  /* Channel 2 Select bit position. */
#define EVSYS_CH3_bm  0x08  /* Channel 3 Select bit mask. */
#define EVSYS_CH3_bp  3  /* Channel 3 Select bit position. */
#define EVSYS_CH4_bm  0x10  /* Channel 4 Select bit mask. */
#define EVSYS_CH4_bp  4  /* Channel 4 Select bit position. */
#define EVSYS_CH5_bm  0x20  /* Channel 5 Select bit mask. */
#define EVSYS_CH5_bp  5  /* Channel 5 Select bit position. */

/* EVSYS.CHANNEL0  bit masks and bit positions */
#define EVSYS_CHANNEL_gm  0xFF  /* Channel Generator Select group mask. */
#define EVSYS_CHANNEL_gp  0  /* Channel Generator Select group position. */
#define EVSYS_CHANNEL_0_bm  (1<<0)  /* Channel Generator Select bit 0 mask. */
#define EVSYS_CHANNEL_0_bp  0  /* Channel Generator Select bit 0 position. */
#define EVSYS_CHANNEL_1_bm  (1<<1)  /* Channel Generator Select bit 1 mask. */
#define EVSYS_CHANNEL_1_bp  1  /* Channel Generator Select bit 1 position. */
#define EVSYS_CHANNEL_2_bm  (1<<2)  /* Channel Generator Select bit 2 mask. */
#define EVSYS_CHANNEL_2_bp  2  /* Channel Generator Select bit 2 position. */
#define EVSYS_CHANNEL_3_bm  (1<<3)  /* Channel Generator Select bit 3 mask. */
#define EVSYS_CHANNEL_3_bp  3  /* Channel Generator Select bit 3 position. */
#define EVSYS_CHANNEL_4_bm  (1<<4)  /* Channel Generator Select bit 4 mask. */
#define EVSYS_CHANNEL_4_bp  4  /* Channel Generator Select bit 4 position. */
#define EVSYS_CHANNEL_5_bm  (1<<5)  /* Channel Generator Select bit 5 mask. */
#define EVSYS_CHANNEL_5_bp  5  /* Channel Generator Select bit 5 position. */
#define EVSYS_CHANNEL_6_bm  (1<<6)  /* Channel Generator Select bit 6 mask. */
#define EVSYS_CHANNEL_6_bp  6  /* Channel Generator Select bit 6 position. */
#define EVSYS_CHANNEL_7_bm  (1<<7)  /* Channel Generator Select bit 7 mask. */
#define EVSYS_CHANNEL_7_bp  7  /* Channel Generator Select bit 7 position. */

