avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* PORTMUX.SPIROUTEA  bit masks and bit positions */
#define PORTMUX_SPI0_gm  0x07  /* SPI0 Signals group mask. */
#define PORTMUX_SPI0_gp  0  /* SPI0 Signals group position. */
#define PORTMUX_SPI0_0_bm  (1<<0)  /* SPI0 Signals bit 0 mask. */
#define PORTMUX_SPI0_0_bp  0  /* SPI0 Signals bit 0 position. */
#define PORTMUX_SPI0_1_bm  (1<<1)  /* SPI0 Signals bit 1 mask. */
#define PORTMUX_SPI0_1_bp  1  /* SPI0 Signals bit 1 position. */
#define PORTMUX_SPI0_2_bm  (1<<2)  /* SPI0 Signals bit 2 mask. */
#define PORTMUX_SPI0_2_bp  2  /* SPI0 Signals bit 2 position. */
#define PORTMUX_SPI1_gm  0x38  /* SPI1 Signals group mask. */
#define PORTMUX_SPI1_gp  3  /* SPI1 Signals group position. */
#define PORTMUX_SPI1_0_bm  (1<<3)  /* SPI1 Signals bit 0 mask. */
#define PORTMUX_SPI1_0_bp  3  /* SPI1 Signals bit 0 position. */
#define PORTMUX_SPI1_1_bm  (1<<4)  /* SPI1 Signals bit 1 mask. */
#define PORTMUX_SPI1_1_bp  4  /* SPI1 Signals bit 1 position. */
#define PORTMUX_SPI1_2_bm  (1<<5)  /* SPI1 Signals bit 2 mask. */
#define PORTMUX_SPI1_2_bp  5  /* SPI1 Signals bit 2 position. */

/* PORTMUX.TWIROUTEA  bit masks and bit positions */
#define PORTMUX_TWI0_gm  0x03  /* TWI0 Signals group mask. */
#define PORTMUX_TWI0_gp  0  /* TWI0 Signals group position. */
#define PORTMUX_TWI0_0_bm  (1<<0)  /* TWI0 Signals bit 0 mask. */
#define PORTMUX_TWI0_0_bp  0  /* TWI0 Signals bit 0 position. */
#define PORTMUX_TWI0_1_bm  (1<<1)  /* TWI0 Signals bit 1 mask. */
#define PORTMUX_TWI0_1_bp  1  /* TWI0 Signals bit 1 position. */

/* PORTMUX.TCAROUTEA  bit masks and bit positions */
#define PORTMUX_TCA0_gm  0x07  /* TCA0 Signals group mask. */
#define PORTMUX_TCA0_gp  0  /* TCA0 Signals group position. */
#define PORTMUX_TCA0_0_bm  (1<<0)  /* TCA0 Signals bit 0 mask. */
#define PORTMUX_TCA0_0_bp  0  /* TCA0 Signals bit 0 position. */
#define PORTMUX_TCA0_1_bm  (1<<1)  /* TCA0 Signals bit 1 mask. */
#define PORTMUX_TCA0_1_bp  1  /* TCA0 Signals bit 1 position. */
#define PORTMUX_TCA0_2_bm  (1<<2)  /* TCA0 Signals bit 2 mask. */
#define PORTMUX_TCA0_2_bp  2  /* TCA0 Signals bit 2 position. */

/* PORTMUX.TCBROUTEA  bit masks and bit positions */
#define PORTMUX_TCB0_bm  0x01  /* TCB0 Output bit mask. */
#define PORTMUX_TCB0_bp  0  /* TCB0 Output bit position. */
#define PORTMUX_TCB1_bm  0x02  /* TCB1 Output bit mask. */
#define PORTMUX_TCB1_bp  1  /* TCB1 Output bit position. */
#define PORTMUX_TCB2_bm  0x04  /* TCB2 Output bit mask. */
#define PORTMUX_TCB2_bp  2  /* TCB2 Output bit position. */
#define PORTMUX_TCB3_bm  0x08  /* TCB3 Output bit mask. */
#define PORTMUX_TCB3_bp  3  /* TCB3 Output bit position. */

/* PORTMUX.TCDROUTEA  bit masks and bit positions */
#define PORTMUX_TCD0_gm  0x07  /* TCD0 Signals group mask. */
#define PORTMUX_TCD0_gp  0  /* TCD0 Signals group position. */
#define PORTMUX_TCD0_0_bm  (1<<0)  /* TCD0 Signals bit 0 mask. */
#define PORTMUX_TCD0_0_bp  0  /* TCD0 Signals bit 0 position. */
#define PORTMUX_TCD0_1_bm  (1<<1)  /* TCD0 Signals bit 1 mask. */
#define PORTMUX_TCD0_1_bp  1  /* TCD0 Signals bit 1 position. */
#define PORTMUX_TCD0_2_bm  (1<<2)  /* TCD0 Signals bit 2 mask. */
#define PORTMUX_TCD0_2_bp  2  /* TCD0 Signals bit 2 position. */

/* PORTMUX.ACROUTEA  bit masks and bit positions */
#define PORTMUX_AC0_bm  0x01  /* Analog Comparator 0 Output bit mask. */
#define PORTMUX_AC0_bp  0  /* Analog Comparator 0 Output bit position. */
#define PORTMUX_AC1_bm  0x02  /* Analog Comparator 1 Output bit mask. */
#define PORTMUX_AC1_bp  1  /* Analog Comparator 1 Output bit position. */
#define PORTMUX_AC2_bm  0x04  /* Analog Comparator 2 Output bit mask. */
#define PORTMUX_AC2_bp  2  /* Analog Comparator 2 Output bit position. */

/* PORTMUX.ZCDROUTEA  bit masks and bit positions */
#define PORTMUX_ZCD0_bm  0x01  /* Zero Cross Detector 0 Output bit mask. */
#define PORTMUX_ZCD0_bp  0  /* Zero Cross Detector 0 Output bit position. */
#define PORTMUX_ZCD3_bm  0x08  /* Zero Cross Detector 3 Output bit mask. */
#define PORTMUX_ZCD3_bp  3  /* Zero Cross Detector 3 Output bit position. */

/* PORTMUX.ERRCTRLROUTEA  bit masks and bit positions */
#define PORTMUX_HEART_gm  0x07  /* Error Controller Heartbeat Output group mask. */
#define PORTMUX_HEART_gp  0  /* Error Controller Heartbeat Output group position. */
#define PORTMUX_HEART_0_bm  (1<<0)  /* Error Controller Heartbeat Output bit 0 mask. */
#define PORTMUX_HEART_0_bp  0  /* Error Controller Heartbeat Output bit 0 position. */
#define PORTMUX_HEART_1_bm  (1<<1)  /* Error Controller Heartbeat Output bit 1 mask. */
#define PORTMUX_HEART_1_bp  1  /* Error Controller Heartbeat Output bit 1 position. */
#define PORTMUX_HEART_2_bm  (1<<2)  /* Error Controller Heartbeat Output bit 2 mask. */
#define PORTMUX_HEART_2_bp  2  /* Error Controller Heartbeat Output bit 2 position. */


/* RAMCTRL - RAM Controller */
/* RAMCTRL.CTRLA  bit masks and bit positions */
#define RAMCTRL_ECC1_bm  0x01  /* Inject 1-bit ECC Error bit mask. */
#define RAMCTRL_ECC1_bp  0  /* Inject 1-bit ECC Error bit position. */
#define RAMCTRL_ECC2_bm  0x02  /* Inject 2-bit ECC Error bit mask. */
#define RAMCTRL_ECC2_bp  1  /* Inject 2-bit ECC Error bit position. */
#define RAMCTRL_COMP_bm  0x04  /* Inject ECC Compare Error bit mask. */
#define RAMCTRL_COMP_bp  2  /* Inject ECC Compare Error bit position. */
#define RAMCTRL_PARITY_bm  0x08  /* Inject Parity Error bit mask. */
#define RAMCTRL_PARITY_bp  3  /* Inject Parity Error bit position. */

/* RAMCTRL.INTFLAGS  bit masks and bit positions */
/* RAMCTRL_ECC1  is already defined. */
/* RAMCTRL_ECC2  is already defined. */
/* RAMCTRL_COMP  is already defined. */
#define RAMCTRL_PARITYC_bm  0x08  /* Parity Error Detected on Control bit mask. */
#define RAMCTRL_PARITYC_bp  3  /* Parity Error Detected on Control bit position. */
#define RAMCTRL_PARITYA_bm  0x10  /* Parity Error Detected on Address bit mask. */
#define RAMCTRL_PARITYA_bp  4  /* Parity Error Detected on Address bit position. */
#define RAMCTRL_PARITYD_bm  0x20  /* Parity Error Detected on Write Data bit mask. */
#define RAMCTRL_PARITYD_bp  5  /* Parity Error Detected on Write Data bit position. */


