avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* SWDT.INTFLAGS  bit masks and bit positions */
#define SWDT_CLEAR_bm  0x01  /* Clear Ready bit mask. */
#define SWDT_CLEAR_bp  0  /* Clear Ready bit position. */
#define SWDT_PRECLEAR_bm  0x02  /* Preclear Ready bit mask. */
#define SWDT_PRECLEAR_bp  1  /* Preclear Ready bit position. */
/* SWDT_ERROR  is already defined. */
#define SWDT_EXP_bm  0x10  /* Counter has expired bit mask. */
#define SWDT_EXP_bp  4  /* Counter has expired bit position. */
#define SWDT_UC_bm  0x20  /* Unexpected Command bit mask. */
#define SWDT_UC_bp  5  /* Unexpected Command bit position. */
#define SWDT_BADC_bm  0x40  /* Non-CLEAR Command received while expecting CLEAR bit mask. */
#define SWDT_BADC_bp  6  /* Non-CLEAR Command received while expecting CLEAR bit position. */
#define SWDT_BADPC_bm  0x80  /* Non-PRECLEAR Command received while expecting PRECLEAR bit mask. */
#define SWDT_BADPC_bp  7  /* Non-PRECLEAR Command received while expecting PRECLEAR bit position. */

/* SWDT.CNT  bit masks and bit positions */
#define SWDT_CNT_gm  0xFFFFFF  /* SWDT Counter group mask. */
#define SWDT_CNT_gp  0  /* SWDT Counter group position. */
#define SWDT_CNT_0_bm  (1<<0)  /* SWDT Counter bit 0 mask. */
#define SWDT_CNT_0_bp  0  /* SWDT Counter bit 0 position. */
#define SWDT_CNT_1_bm  (1<<1)  /* SWDT Counter bit 1 mask. */
#define SWDT_CNT_1_bp  1  /* SWDT Counter bit 1 position. */
#define SWDT_CNT_2_bm  (1<<2)  /* SWDT Counter bit 2 mask. */
#define SWDT_CNT_2_bp  2  /* SWDT Counter bit 2 position. */
#define SWDT_CNT_3_bm  (1<<3)  /* SWDT Counter bit 3 mask. */
#define SWDT_CNT_3_bp  3  /* SWDT Counter bit 3 position. */
#define SWDT_CNT_4_bm  (1<<4)  /* SWDT Counter bit 4 mask. */
#define SWDT_CNT_4_bp  4  /* SWDT Counter bit 4 position. */
#define SWDT_CNT_5_bm  (1<<5)  /* SWDT Counter bit 5 mask. */
#define SWDT_CNT_5_bp  5  /* SWDT Counter bit 5 position. */
#define SWDT_CNT_6_bm  (1<<6)  /* SWDT Counter bit 6 mask. */
#define SWDT_CNT_6_bp  6  /* SWDT Counter bit 6 position. */
#define SWDT_CNT_7_bm  (1<<7)  /* SWDT Counter bit 7 mask. */
#define SWDT_CNT_7_bp  7  /* SWDT Counter bit 7 position. */
#define SWDT_CNT_8_bm  (1<<8)  /* SWDT Counter bit 8 mask. */
#define SWDT_CNT_8_bp  8  /* SWDT Counter bit 8 position. */
#define SWDT_CNT_9_bm  (1<<9)  /* SWDT Counter bit 9 mask. */
#define SWDT_CNT_9_bp  9  /* SWDT Counter bit 9 position. */
#define SWDT_CNT_10_bm  (1<<10)  /* SWDT Counter bit 10 mask. */
#define SWDT_CNT_10_bp  10  /* SWDT Counter bit 10 position. */
#define SWDT_CNT_11_bm  (1<<11)  /* SWDT Counter bit 11 mask. */
#define SWDT_CNT_11_bp  11  /* SWDT Counter bit 11 position. */
#define SWDT_CNT_12_bm  (1<<12)  /* SWDT Counter bit 12 mask. */
#define SWDT_CNT_12_bp  12  /* SWDT Counter bit 12 position. */
#define SWDT_CNT_13_bm  (1<<13)  /* SWDT Counter bit 13 mask. */
#define SWDT_CNT_13_bp  13  /* SWDT Counter bit 13 position. */
#define SWDT_CNT_14_bm  (1<<14)  /* SWDT Counter bit 14 mask. */
#define SWDT_CNT_14_bp  14  /* SWDT Counter bit 14 position. */
#define SWDT_CNT_15_bm  (1<<15)  /* SWDT Counter bit 15 mask. */
#define SWDT_CNT_15_bp  15  /* SWDT Counter bit 15 position. */
#define SWDT_CNT_16_bm  (1<<16)  /* SWDT Counter bit 16 mask. */
#define SWDT_CNT_16_bp  16  /* SWDT Counter bit 16 position. */
#define SWDT_CNT_17_bm  (1<<17)  /* SWDT Counter bit 17 mask. */
#define SWDT_CNT_17_bp  17  /* SWDT Counter bit 17 position. */
#define SWDT_CNT_18_bm  (1<<18)  /* SWDT Counter bit 18 mask. */
#define SWDT_CNT_18_bp  18  /* SWDT Counter bit 18 position. */
#define SWDT_CNT_19_bm  (1<<19)  /* SWDT Counter bit 19 mask. */
#define SWDT_CNT_19_bp  19  /* SWDT Counter bit 19 position. */
#define SWDT_CNT_20_bm  (1<<20)  /* SWDT Counter bit 20 mask. */
#define SWDT_CNT_20_bp  20  /* SWDT Counter bit 20 position. */
#define SWDT_CNT_21_bm  (1<<21)  /* SWDT Counter bit 21 mask. */
#define SWDT_CNT_21_bp  21  /* SWDT Counter bit 21 position. */
#define SWDT_CNT_22_bm  (1<<22)  /* SWDT Counter bit 22 mask. */
#define SWDT_CNT_22_bp  22  /* SWDT Counter bit 22 position. */
#define SWDT_CNT_23_bm  (1<<23)  /* SWDT Counter bit 23 mask. */
#define SWDT_CNT_23_bp  23  /* SWDT Counter bit 23 position. */

/* SWDT.RESET  bit masks and bit positions */
#define SWDT_RESET_gm  0xFFFFFF  /* SWDT Counter Reset Value group mask. */
#define SWDT_RESET_gp  0  /* SWDT Counter Reset Value group position. */
#define SWDT_RESET_0_bm  (1<<0)  /* SWDT Counter Reset Value bit 0 mask. */
#define SWDT_RESET_0_bp  0  /* SWDT Counter Reset Value bit 0 position. */
#define SWDT_RESET_1_bm  (1<<1)  /* SWDT Counter Reset Value bit 1 mask. */
#define SWDT_RESET_1_bp  1  /* SWDT Counter Reset Value bit 1 position. */
#define SWDT_RESET_2_bm  (1<<2)  /* SWDT Counter Reset Value bit 2 mask. */
#define SWDT_RESET_2_bp  2  /* SWDT Counter Reset Value bit 2 position. */
#define SWDT_RESET_3_bm  (1<<3)  /* SWDT Counter Reset Value bit 3 mask. */
#define SWDT_RESET_3_bp  3  /* SWDT Counter Reset Value bit 3 position. */
#define SWDT_RESET_4_bm  (1<<4)  /* SWDT Counter Reset Value bit 4 mask. */
#define SWDT_RESET_4_bp  4  /* SWDT Counter Reset Value bit 4 position. */
#define SWDT_RESET_5_bm  (1<<5)  /* SWDT Counter Reset Value bit 5 mask. */
#define SWDT_RESET_5_bp  5  /* SWDT Counter Reset Value bit 5 position. */
#define SWDT_RESET_6_bm  (1<<6)  /* SWDT Counter Reset Value bit 6 mask. */
#define SWDT_RESET_6_bp  6  /* SWDT Counter Reset Value bit 6 position. */
#define SWDT_RESET_7_bm  (1<<7)  /* SWDT Counter Reset Value bit 7 mask. */
#define SWDT_RESET_7_bp  7  /* SWDT Counter Reset Value bit 7 position. */
#define SWDT_RESET_8_bm  (1<<8)  /* SWDT Counter Reset Value bit 8 mask. */
#define SWDT_RESET_8_bp  8  /* SWDT Counter Reset Value bit 8 position. */
#define SWDT_RESET_9_bm  (1<<9)  /* SWDT Counter Reset Value bit 9 mask. */
#define SWDT_RESET_9_bp  9  /* SWDT Counter Reset Value bit 9 position. */
#define SWDT_RESET_10_bm  (1<<10)  /* SWDT Counter Reset Value bit 10 mask. */
#define SWDT_RESET_10_bp  10  /* SWDT Counter Reset Value bit 10 position. */
#define SWDT_RESET_11_bm  (1<<11)  /* SWDT Counter Reset Value bit 11 mask. */
#define SWDT_RESET_11_bp  11  /* SWDT Counter Reset Value bit 11 position. */
#define SWDT_RESET_12_bm  (1<<12)  /* SWDT Counter Reset Value bit 12 mask. */
#define SWDT_RESET_12_bp  12  /* SWDT Counter Reset Value bit 12 position. */
#define SWDT_RESET_13_bm  (1<<13)  /* SWDT Counter Reset Value bit 13 mask. */
#define SWDT_RESET_13_bp  13  /* SWDT Counter Reset Value bit 13 position. */
#define SWDT_RESET_14_bm  (1<<14)  /* SWDT Counter Reset Value bit 14 mask. */
#define SWDT_RESET_14_bp  14  /* SWDT Counter Reset Value bit 14 position. */
#define SWDT_RESET_15_bm  (1<<15)  /* SWDT Counter Reset Value bit 15 mask. */
#define SWDT_RESET_15_bp  15  /* SWDT Counter Reset Value bit 15 position. */
#define SWDT_RESET_16_bm  (1<<16)  /* SWDT Counter Reset Value bit 16 mask. */
#define SWDT_RESET_16_bp  16  /* SWDT Counter Reset Value bit 16 position. */
#define SWDT_RESET_17_bm  (1<<17)  /* SWDT Counter Reset Value bit 17 mask. */
#define SWDT_RESET_17_bp  17  /* SWDT Counter Reset Value bit 17 position. */
#define SWDT_RESET_18_bm  (1<<18)  /* SWDT Counter Reset Value bit 18 mask. */
#define SWDT_RESET_18_bp  18  /* SWDT Counter Reset Value bit 18 position. */
#define SWDT_RESET_19_bm  (1<<19)  /* SWDT Counter Reset Value bit 19 mask. */
#define SWDT_RESET_19_bp  19  /* SWDT Counter Reset Value bit 19 position. */
#define SWDT_RESET_20_bm  (1<<20)  /* SWDT Counter Reset Value bit 20 mask. */
#define SWDT_RESET_20_bp  20  /* SWDT Counter Reset Value bit 20 position. */
#define SWDT_RESET_21_bm  (1<<21)  /* SWDT Counter Reset Value bit 21 mask. */
#define SWDT_RESET_21_bp  21  /* SWDT Counter Reset Value bit 21 position. */
#define SWDT_RESET_22_bm  (1<<22)  /* SWDT Counter Reset Value bit 22 mask. */
#define SWDT_RESET_22_bp  22  /* SWDT Counter Reset Value bit 22 position. */
#define SWDT_RESET_23_bm  (1<<23)  /* SWDT Counter Reset Value bit 23 mask. */
#define SWDT_RESET_23_bp  23  /* SWDT Counter Reset Value bit 23 position. */

/* SWDT.COMMAND  bit masks and bit positions */
#define SWDT_COMMAND_gm  0xFF  /* SWDT Command group mask. */
#define SWDT_COMMAND_gp  0  /* SWDT Command group position. */
#define SWDT_COMMAND_0_bm  (1<<0)  /* SWDT Command bit 0 mask. */
#define SWDT_COMMAND_0_bp  0  /* SWDT Command bit 0 position. */
#define SWDT_COMMAND_1_bm  (1<<1)  /* SWDT Command bit 1 mask. */
#define SWDT_COMMAND_1_bp  1  /* SWDT Command bit 1 position. */
#define SWDT_COMMAND_2_bm  (1<<2)  /* SWDT Command bit 2 mask. */
#define SWDT_COMMAND_2_bp  2  /* SWDT Command bit 2 position. */
#define SWDT_COMMAND_3_bm  (1<<3)  /* SWDT Command bit 3 mask. */
#define SWDT_COMMAND_3_bp  3  /* SWDT Command bit 3 position. */
#define SWDT_COMMAND_4_bm  (1<<4)  /* SWDT Command bit 4 mask. */
#define SWDT_COMMAND_4_bp  4  /* SWDT Command bit 4 position. */
#define SWDT_COMMAND_5_bm  (1<<5)  /* SWDT Command bit 5 mask. */
#define SWDT_COMMAND_5_bp  5  /* SWDT Command bit 5 position. */
#define SWDT_COMMAND_6_bm  (1<<6)  /* SWDT Command bit 6 mask. */
#define SWDT_COMMAND_6_bp  6  /* SWDT Command bit 6 position. */
#define SWDT_COMMAND_7_bm  (1<<7)  /* SWDT Command bit 7 mask. */
#define SWDT_COMMAND_7_bp  7  /* SWDT Command bit 7 position. */


