avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* VPORT - Virtual Ports */
/* VPORT.INTFLAGS  bit masks and bit positions */
#define VPORT_INT_gm  0xFF  /* Pin Interrupt Flag group mask. */
#define VPORT_INT_gp  0  /* Pin Interrupt Flag group position. */
#define VPORT_INT_0_bm  (1<<0)  /* Pin Interrupt Flag bit 0 mask. */
#define VPORT_INT_0_bp  0  /* Pin Interrupt Flag bit 0 position. */
#define VPORT_INT_1_bm  (1<<1)  /* Pin Interrupt Flag bit 1 mask. */
#define VPORT_INT_1_bp  1  /* Pin Interrupt Flag bit 1 position. */
#define VPORT_INT_2_bm  (1<<2)  /* Pin Interrupt Flag bit 2 mask. */
#define VPORT_INT_2_bp  2  /* Pin Interrupt Flag bit 2 position. */
#define VPORT_INT_3_bm  (1<<3)  /* Pin Interrupt Flag bit 3 mask. */
#define VPORT_INT_3_bp  3  /* Pin Interrupt Flag bit 3 position. */
#define VPORT_INT_4_bm  (1<<4)  /* Pin Interrupt Flag bit 4 mask. */
#define VPORT_INT_4_bp  4  /* Pin Interrupt Flag bit 4 position. */
#define VPORT_INT_5_bm  (1<<5)  /* Pin Interrupt Flag bit 5 mask. */
#define VPORT_INT_5_bp  5  /* Pin Interrupt Flag bit 5 position. */
#define VPORT_INT_6_bm  (1<<6)  /* Pin Interrupt Flag bit 6 mask. */
#define VPORT_INT_6_bp  6  /* Pin Interrupt Flag bit 6 position. */
#define VPORT_INT_7_bm  (1<<7)  /* Pin Interrupt Flag bit 7 mask. */
#define VPORT_INT_7_bp  7  /* Pin Interrupt Flag bit 7 position. */


/* VREF - Voltage Reference */
/* VREF.DAC0REF  bit masks and bit positions */
#define VREF_REFSEL_gm  0x07  /* Reference select group mask. */
#define VREF_REFSEL_gp  0  /* Reference select group position. */
#define VREF_REFSEL_0_bm  (1<<0)  /* Reference select bit 0 mask. */
#define VREF_REFSEL_0_bp  0  /* Reference select bit 0 position. */
#define VREF_REFSEL_1_bm  (1<<1)  /* Reference select bit 1 mask. */
#define VREF_REFSEL_1_bp  1  /* Reference select bit 1 position. */
#define VREF_REFSEL_2_bm  (1<<2)  /* Reference select bit 2 mask. */
#define VREF_REFSEL_2_bp  2  /* Reference select bit 2 position. */
#define VREF_ALWAYSON_bm  0x80  /* Always on bit mask. */
#define VREF_ALWAYSON_bp  7  /* Always on bit position. */

/* VREF.ACREF  bit masks and bit positions */
/* VREF_REFSEL  is already defined. */
/* VREF_ALWAYSON  is already defined. */


/* WDT - Watchdog Timer */
/* WDT.CTRLA  bit masks and bit positions */
#define WDT_PERIOD_gm  0x0F  /* Period group mask. */
#define WDT_PERIOD_gp  0  /* Period group position. */
#define WDT_PERIOD_0_bm  (1<<0)  /* Period bit 0 mask. */
#define WDT_PERIOD_0_bp  0  /* Period bit 0 position. */
#define WDT_PERIOD_1_bm  (1<<1)  /* Period bit 1 mask. */
#define WDT_PERIOD_1_bp  1  /* Period bit 1 position. */
#define WDT_PERIOD_2_bm  (1<<2)  /* Period bit 2 mask. */
#define WDT_PERIOD_2_bp  2  /* Period bit 2 position. */
#define WDT_PERIOD_3_bm  (1<<3)  /* Period bit 3 mask. */
#define WDT_PERIOD_3_bp  3  /* Period bit 3 position. */
#define WDT_WINDOW_gm  0xF0  /* Window group mask. */
#define WDT_WINDOW_gp  4  /* Window group position. */
#define WDT_WINDOW_0_bm  (1<<4)  /* Window bit 0 mask. */
#define WDT_WINDOW_0_bp  4  /* Window bit 0 position. */
#define WDT_WINDOW_1_bm  (1<<5)  /* Window bit 1 mask. */
#define WDT_WINDOW_1_bp  5  /* Window bit 1 position. */
#define WDT_WINDOW_2_bm  (1<<6)  /* Window bit 2 mask. */
#define WDT_WINDOW_2_bp  6  /* Window bit 2 position. */
#define WDT_WINDOW_3_bm  (1<<7)  /* Window bit 3 mask. */
#define WDT_WINDOW_3_bp  7  /* Window bit 3 position. */

/* WDT.CTRLB  bit masks and bit positions */
#define WDT_WDTMON_gm  0xC0  /* WDT Clock Monitor group mask. */
#define WDT_WDTMON_gp  6  /* WDT Clock Monitor group position. */
#define WDT_WDTMON_0_bm  (1<<6)  /* WDT Clock Monitor bit 0 mask. */
#define WDT_WDTMON_0_bp  6  /* WDT Clock Monitor bit 0 position. */
#define WDT_WDTMON_1_bm  (1<<7)  /* WDT Clock Monitor bit 1 mask. */
#define WDT_WDTMON_1_bp  7  /* WDT Clock Monitor bit 1 position. */

/* WDT.STATUS  bit masks and bit positions */
#define WDT_SYNCBUSY_bm  0x01  /* Syncronization busy bit mask. */
#define WDT_SYNCBUSY_bp  0  /* Syncronization busy bit position. */
#define WDT_CNTBUSY_bm  0x02  /* CNT Synchronization Busy bit mask. */
#define WDT_CNTBUSY_bp  1  /* CNT Synchronization Busy bit position. */
#define WDT_CAUSE_bm  0x04  /* Reset Cause bit mask. */
#define WDT_CAUSE_bp  2  /* Reset Cause bit position. */
#define WDT_LOCK_bm  0x80  /* Lock enable bit mask. */
#define WDT_LOCK_bp  7  /* Lock enable bit position. */

/* WDT.CNT  bit masks and bit positions */
#define WDT_CNT_gm  0x3FFF  /* Counter group mask. */
#define WDT_CNT_gp  0  /* Counter group position. */
#define WDT_CNT_0_bm  (1<<0)  /* Counter bit 0 mask. */
#define WDT_CNT_0_bp  0  /* Counter bit 0 position. */
#define WDT_CNT_1_bm  (1<<1)  /* Counter bit 1 mask. */
#define WDT_CNT_1_bp  1  /* Counter bit 1 position. */
#define WDT_CNT_2_bm  (1<<2)  /* Counter bit 2 mask. */
#define WDT_CNT_2_bp  2  /* Counter bit 2 position. */
#define WDT_CNT_3_bm  (1<<3)  /* Counter bit 3 mask. */
#define WDT_CNT_3_bp  3  /* Counter bit 3 position. */
#define WDT_CNT_4_bm  (1<<4)  /* Counter bit 4 mask. */
#define WDT_CNT_4_bp  4  /* Counter bit 4 position. */
#define WDT_CNT_5_bm  (1<<5)  /* Counter bit 5 mask. */
#define WDT_CNT_5_bp  5  /* Counter bit 5 position. */
#define WDT_CNT_6_bm  (1<<6)  /* Counter bit 6 mask. */
#define WDT_CNT_6_bp  6  /* Counter bit 6 position. */
#define WDT_CNT_7_bm  (1<<7)  /* Counter bit 7 mask. */
#define WDT_CNT_7_bp  7  /* Counter bit 7 position. */
#define WDT_CNT_8_bm  (1<<8)  /* Counter bit 8 mask. */
#define WDT_CNT_8_bp  8  /* Counter bit 8 position. */
#define WDT_CNT_9_bm  (1<<9)  /* Counter bit 9 mask. */
#define WDT_CNT_9_bp  9  /* Counter bit 9 position. */
#define WDT_CNT_10_bm  (1<<10)  /* Counter bit 10 mask. */
#define WDT_CNT_10_bp  10  /* Counter bit 10 position. */
#define WDT_CNT_11_bm  (1<<11)  /* Counter bit 11 mask. */
#define WDT_CNT_11_bp  11  /* Counter bit 11 position. */
#define WDT_CNT_12_bm  (1<<12)  /* Counter bit 12 mask. */
#define WDT_CNT_12_bp  12  /* Counter bit 12 position. */
#define WDT_CNT_13_bm  (1<<13)  /* Counter bit 13 mask. */
#define WDT_CNT_13_bp  13  /* Counter bit 13 position. */


