avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* Channel Generator Select bit group configurations*/
typedef enum EVSYS_CHANNEL_enum
{
    EVSYS_CHANNEL_OFF_gc           = (EVSYS_CHANNEL_OFF_gv << EVSYS_CHANNEL_gp),  /* Off */
    EVSYS_CHANNEL_UPDI_SYNCH_gc    = (EVSYS_CHANNEL_UPDI_SYNCH_gv << EVSYS_CHANNEL_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL_WDT_TICK_gc      = (EVSYS_CHANNEL_WDT_TICK_gv << EVSYS_CHANNEL_gp),  /* WDT LSB Tick */
    EVSYS_CHANNEL_SWDT_ERROR_gc    = (EVSYS_CHANNEL_SWDT_ERROR_gv << EVSYS_CHANNEL_gp),  /* SWDT Error */
    EVSYS_CHANNEL_MVIO_VDDIO2OK_gc = (EVSYS_CHANNEL_MVIO_VDDIO2OK_gv << EVSYS_CHANNEL_gp),  /* VDDIO2 OK */
    EVSYS_CHANNEL_RTC_OVF_gc       = (EVSYS_CHANNEL_RTC_OVF_gv << EVSYS_CHANNEL_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL_RTC_CMP_gc       = (EVSYS_CHANNEL_RTC_CMP_gv << EVSYS_CHANNEL_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL_RTC_EVGEN0_gc    = (EVSYS_CHANNEL_RTC_EVGEN0_gv << EVSYS_CHANNEL_gp),  /* Event output 0 */
    EVSYS_CHANNEL_RTC_EVGEN1_gc    = (EVSYS_CHANNEL_RTC_EVGEN1_gv << EVSYS_CHANNEL_gp),  /* Event output 1 */
    EVSYS_CHANNEL_CCL_LUT0_gc      = (EVSYS_CHANNEL_CCL_LUT0_gv << EVSYS_CHANNEL_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL_CCL_LUT1_gc      = (EVSYS_CHANNEL_CCL_LUT1_gv << EVSYS_CHANNEL_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL_CCL_LUT2_gc      = (EVSYS_CHANNEL_CCL_LUT2_gv << EVSYS_CHANNEL_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL_CCL_LUT3_gc      = (EVSYS_CHANNEL_CCL_LUT3_gv << EVSYS_CHANNEL_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL_CCL_LUT4_gc      = (EVSYS_CHANNEL_CCL_LUT4_gv << EVSYS_CHANNEL_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL_CCL_LUT5_gc      = (EVSYS_CHANNEL_CCL_LUT5_gv << EVSYS_CHANNEL_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL_AC0_OUT_gc       = (EVSYS_CHANNEL_AC0_OUT_gv << EVSYS_CHANNEL_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL_AC1_OUT_gc       = (EVSYS_CHANNEL_AC1_OUT_gv << EVSYS_CHANNEL_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL_AC2_OUT_gc       = (EVSYS_CHANNEL_AC2_OUT_gv << EVSYS_CHANNEL_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL_ADC0_RESRDY_gc   = (EVSYS_CHANNEL_ADC0_RESRDY_gv << EVSYS_CHANNEL_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL_ADC0_SAMPRDY_gc  = (EVSYS_CHANNEL_ADC0_SAMPRDY_gv << EVSYS_CHANNEL_gp),  /* ADC 0 Sample Ready */
    EVSYS_CHANNEL_ADC0_WCMP_gc     = (EVSYS_CHANNEL_ADC0_WCMP_gv << EVSYS_CHANNEL_gp),  /* ADC 0 Window Comparator */
    EVSYS_CHANNEL_ADC1_RESRDY_gc   = (EVSYS_CHANNEL_ADC1_RESRDY_gv << EVSYS_CHANNEL_gp),  /* ADC 1 Result Ready */
    EVSYS_CHANNEL_ADC1_SAMPRDY_gc  = (EVSYS_CHANNEL_ADC1_SAMPRDY_gv << EVSYS_CHANNEL_gp),  /* ADC 1 Sample Ready */
    EVSYS_CHANNEL_ADC1_WCMP_gc     = (EVSYS_CHANNEL_ADC1_WCMP_gv << EVSYS_CHANNEL_gp),  /* ADC 1 Window Comparator */
    EVSYS_CHANNEL_ZCD0_OUT_gc      = (EVSYS_CHANNEL_ZCD0_OUT_gv << EVSYS_CHANNEL_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL_ZCD3_OUT_gc      = (EVSYS_CHANNEL_ZCD3_OUT_gv << EVSYS_CHANNEL_gp),  /* Zero Cross Detect 3 out */
    EVSYS_CHANNEL_PORTA_EVGEN0_gc  = (EVSYS_CHANNEL_PORTA_EVGEN0_gv << EVSYS_CHANNEL_gp),  /* Port A Event 0 */
    EVSYS_CHANNEL_PORTA_EVGEN1_gc  = (EVSYS_CHANNEL_PORTA_EVGEN1_gv << EVSYS_CHANNEL_gp),  /* Port A Event 1 */
    EVSYS_CHANNEL_PORTC_EVGEN0_gc  = (EVSYS_CHANNEL_PORTC_EVGEN0_gv << EVSYS_CHANNEL_gp),  /* Port C Event 0 */
    EVSYS_CHANNEL_PORTC_EVGEN1_gc  = (EVSYS_CHANNEL_PORTC_EVGEN1_gv << EVSYS_CHANNEL_gp),  /* Port C Event 1 */
    EVSYS_CHANNEL_PORTD_EVGEN0_gc  = (EVSYS_CHANNEL_PORTD_EVGEN0_gv << EVSYS_CHANNEL_gp),  /* Port D Event 0 */
    EVSYS_CHANNEL_PORTD_EVGEN1_gc  = (EVSYS_CHANNEL_PORTD_EVGEN1_gv << EVSYS_CHANNEL_gp),  /* Port D Event 1 */
    EVSYS_CHANNEL_PORTF_EVGEN0_gc  = (EVSYS_CHANNEL_PORTF_EVGEN0_gv << EVSYS_CHANNEL_gp),  /* Port F Event 0 */
    EVSYS_CHANNEL_PORTF_EVGEN1_gc  = (EVSYS_CHANNEL_PORTF_EVGEN1_gv << EVSYS_CHANNEL_gp),  /* Port F Event 1 */
    EVSYS_CHANNEL_USART0_XCK_gc    = (EVSYS_CHANNEL_USART0_XCK_gv << EVSYS_CHANNEL_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL_USART1_XCK_gc    = (EVSYS_CHANNEL_USART1_XCK_gv << EVSYS_CHANNEL_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL_USART2_XCK_gc    = (EVSYS_CHANNEL_USART2_XCK_gv << EVSYS_CHANNEL_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL_SPI0_SCK_gc      = (EVSYS_CHANNEL_SPI0_SCK_gv << EVSYS_CHANNEL_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL_SPI1_SCK_gc      = (EVSYS_CHANNEL_SPI1_SCK_gv << EVSYS_CHANNEL_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL_TCA0_HUNF_gc     = (EVSYS_CHANNEL_TCA0_HUNF_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 1 */
    EVSYS_CHANNEL_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 2 */
    EVSYS_CHANNEL_TCB0_CAPT_gc     = (EVSYS_CHANNEL_TCB0_CAPT_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL_TCB0_OVF_gc      = (EVSYS_CHANNEL_TCB0_OVF_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL_TCB1_CAPT_gc     = (EVSYS_CHANNEL_TCB1_CAPT_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL_TCB1_OVF_gc      = (EVSYS_CHANNEL_TCB1_OVF_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL_TCB2_CAPT_gc     = (EVSYS_CHANNEL_TCB2_CAPT_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL_TCB2_OVF_gc      = (EVSYS_CHANNEL_TCB2_OVF_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL_TCB3_CAPT_gc     = (EVSYS_CHANNEL_TCB3_CAPT_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL_TCB3_OVF_gc      = (EVSYS_CHANNEL_TCB3_OVF_gv << EVSYS_CHANNEL_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL_TCD0_CMPBCLR_gc  = (EVSYS_CHANNEL_TCD0_CMPBCLR_gv << EVSYS_CHANNEL_gp),  /* Counter matches CMPBCLR */
    EVSYS_CHANNEL_TCD0_CMPASET_gc  = (EVSYS_CHANNEL_TCD0_CMPASET_gv << EVSYS_CHANNEL_gp),  /* Counter matches CMPASET */
    EVSYS_CHANNEL_TCD0_CMPBSET_gc  = (EVSYS_CHANNEL_TCD0_CMPBSET_gv << EVSYS_CHANNEL_gp),  /* Counter matches CMPBSET */
    EVSYS_CHANNEL_TCD0_PROGEV_gc   = (EVSYS_CHANNEL_TCD0_PROGEV_gv << EVSYS_CHANNEL_gp)   /* Programmable event output */
} EVSYS_CHANNEL_t;

/* User channel select bit group values */
typedef enum EVSYS_USER_VALUES_enum
{
    EVSYS_USER_OFF_gv              = 0x00,  /* Off */
    EVSYS_USER_CHANNEL0_gv         = 0x01,  /* Connect user to event channel 0 */
    EVSYS_USER_CHANNEL1_gv         = 0x02,  /* Connect user to event channel 1 */
    EVSYS_USER_CHANNEL2_gv         = 0x03,  /* Connect user to event channel 2 */
    EVSYS_USER_CHANNEL3_gv         = 0x04,  /* Connect user to event channel 3 */
    EVSYS_USER_CHANNEL4_gv         = 0x05,  /* Connect user to event channel 4 */
    EVSYS_USER_CHANNEL5_gv         = 0x06   /* Connect user to event channel 5 */
} EVSYS_USER_values_t;

