avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* WDT Clock Monitor select bit group values */
typedef enum WDT_WDTMON_VALUES_enum
{
    WDT_WDTMON_OFF_gv              = 0x00,  /* Monitor is disabled */
    WDT_WDTMON_ON_gv               = 0x01,  /* Monitor is always on */
    WDT_WDTMON_SLEEP_gv            = 0x02   /* Monitor is always on in normal and IDLE mode, but automatically disabled when the MCU is in POWERDOWN and STANDBY sleep modes */
} WDT_WDTMON_values_t;

/* WDT Clock Monitor select bit group configurations*/
typedef enum WDT_WDTMON_enum
{
    WDT_WDTMON_OFF_gc              = (WDT_WDTMON_OFF_gv << WDT_WDTMON_gp),  /* Monitor is disabled */
    WDT_WDTMON_ON_gc               = (WDT_WDTMON_ON_gv << WDT_WDTMON_gp),  /* Monitor is always on */
    WDT_WDTMON_SLEEP_gc            = (WDT_WDTMON_SLEEP_gv << WDT_WDTMON_gp)   /* Monitor is always on in normal and IDLE mode, but automatically disabled when the MCU is in POWERDOWN and STANDBY sleep modes */
} WDT_WDTMON_t;

/* Window select bit group values */
typedef enum WDT_WINDOW_VALUES_enum
{
    WDT_WINDOW_OFF_gv              = 0x00,  /* Off */
    WDT_WINDOW_8CLK_gv             = 0x01,  /* 8 cycles (244 us) */
    WDT_WINDOW_16CLK_gv            = 0x02,  /* 16 cycles (488 us) */
    WDT_WINDOW_32CLK_gv            = 0x03,  /* 32 cycles (976 us) */
    WDT_WINDOW_64CLK_gv            = 0x04,  /* 64 cycles (1.95 ms) */
    WDT_WINDOW_128CLK_gv           = 0x05,  /* 128 cycles (3.9 ms) */
    WDT_WINDOW_256CLK_gv           = 0x06,  /* 256 cycles (7.8 ms) */
    WDT_WINDOW_512CLK_gv           = 0x07,  /* 512 cycles (15.625 ms) */
    WDT_WINDOW_1KCLK_gv            = 0x08,  /* 1K cycles (31.25 ms) */
    WDT_WINDOW_2KCLK_gv            = 0x09,  /* 2K cycles (62.5 ms) */
    WDT_WINDOW_4KCLK_gv            = 0x0A,  /* 4K cycles (125 ms) */
    WDT_WINDOW_8KCLK_gv            = 0x0B   /* 8K cycles (250 ms) */
} WDT_WINDOW_values_t;

/* Window select bit group configurations*/
typedef enum WDT_WINDOW_enum
{
    WDT_WINDOW_OFF_gc              = (WDT_WINDOW_OFF_gv << WDT_WINDOW_gp),  /* Off */
    WDT_WINDOW_8CLK_gc             = (WDT_WINDOW_8CLK_gv << WDT_WINDOW_gp),  /* 8 cycles (244 us) */
    WDT_WINDOW_16CLK_gc            = (WDT_WINDOW_16CLK_gv << WDT_WINDOW_gp),  /* 16 cycles (488 us) */
    WDT_WINDOW_32CLK_gc            = (WDT_WINDOW_32CLK_gv << WDT_WINDOW_gp),  /* 32 cycles (976 us) */
    WDT_WINDOW_64CLK_gc            = (WDT_WINDOW_64CLK_gv << WDT_WINDOW_gp),  /* 64 cycles (1.95 ms) */
    WDT_WINDOW_128CLK_gc           = (WDT_WINDOW_128CLK_gv << WDT_WINDOW_gp),  /* 128 cycles (3.9 ms) */
    WDT_WINDOW_256CLK_gc           = (WDT_WINDOW_256CLK_gv << WDT_WINDOW_gp),  /* 256 cycles (7.8 ms) */
    WDT_WINDOW_512CLK_gc           = (WDT_WINDOW_512CLK_gv << WDT_WINDOW_gp),  /* 512 cycles (15.625 ms) */
    WDT_WINDOW_1KCLK_gc            = (WDT_WINDOW_1KCLK_gv << WDT_WINDOW_gp),  /* 1K cycles (31.25 ms) */
    WDT_WINDOW_2KCLK_gc            = (WDT_WINDOW_2KCLK_gv << WDT_WINDOW_gp),  /* 2K cycles (62.5 ms) */
    WDT_WINDOW_4KCLK_gc            = (WDT_WINDOW_4KCLK_gv << WDT_WINDOW_gp),  /* 4K cycles (125 ms) */
    WDT_WINDOW_8KCLK_gc            = (WDT_WINDOW_8KCLK_gv << WDT_WINDOW_gp)   /* 8K cycles (250 ms) */
} WDT_WINDOW_t;

/*
--------------------------------------------------------------------------
ZCD - Zero Cross Detect
--------------------------------------------------------------------------
*/

/* Zero Cross Detect */
typedef struct ZCD_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t reserved_1[1];
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t STATUS;  /* Status */
    register8_t reserved_2[4];
} ZCD_t;

/* Interrupt Mode select bit group values */
typedef enum ZCD_INTMODE_VALUES_enum
{
    ZCD_INTMODE_NONE_gv            = 0x00,  /* No interrupt */
    ZCD_INTMODE_RISING_gv          = 0x01,  /* Interrupt on rising input signal */
    ZCD_INTMODE_FALLING_gv         = 0x02,  /* Interrupt on falling input signal */
    ZCD_INTMODE_BOTH_gv            = 0x03   /* Interrupt on both rising and falling input signal */
} ZCD_INTMODE_values_t;

/* Interrupt Mode select bit group configurations*/
typedef enum ZCD_INTMODE_enum
{
    ZCD_INTMODE_NONE_gc            = (ZCD_INTMODE_NONE_gv << ZCD_INTMODE_gp),  /* No interrupt */
    ZCD_INTMODE_RISING_gc          = (ZCD_INTMODE_RISING_gv << ZCD_INTMODE_gp),  /* Interrupt on rising input signal */
    ZCD_INTMODE_FALLING_gc         = (ZCD_INTMODE_FALLING_gv << ZCD_INTMODE_gp),  /* Interrupt on falling input signal */
    ZCD_INTMODE_BOTH_gc            = (ZCD_INTMODE_BOTH_gv << ZCD_INTMODE_gp)   /* Interrupt on both rising and falling input signal */
} ZCD_INTMODE_t;

/* ZCD State select bit group values */
typedef enum ZCD_STATE_VALUES_enum
{
    ZCD_STATE_LOW_gv               = 0x00,  /* Output is 0 */
    ZCD_STATE_HIGH_gv              = 0x01   /* Output is 1 */
} ZCD_STATE_values_t;

/* ZCD State select bit group configurations*/
typedef enum ZCD_STATE_enum
{
    ZCD_STATE_LOW_gc               = (ZCD_STATE_LOW_gv << ZCD_STATE_bp),  /* Output is 0 */
    ZCD_STATE_HIGH_gc              = (ZCD_STATE_HIGH_gv << ZCD_STATE_bp)   /* Output is 1 */
} ZCD_STATE_t;
/*
==========================================================================
IO Module Instances. Mapped to memory.
==========================================================================
*/

#define VPORTA              (*(VPORT_t *) 0x0000) /* Virtual Ports */
#define VPORTC              (*(VPORT_t *) 0x0008) /* Virtual Ports */
#define VPORTD              (*(VPORT_t *) 0x000C) /* Virtual Ports */
#define VPORTF              (*(VPORT_t *) 0x0014) /* Virtual Ports */
#define GPR                   (*(GPR_t *) 0x001C) /* General Purpose Registers */
#define RSTCTRL           (*(RSTCTRL_t *) 0x0040) /* Reset controller */
#define SLPCTRL           (*(SLPCTRL_t *) 0x0050) /* Sleep Controller */
#define BOD                   (*(BOD_t *) 0x0060) /* Bod interface */
#define VREF                 (*(VREF_t *) 0x0070) /* Voltage Reference */
#define CLKCTRL           (*(CLKCTRL_t *) 0x0080) /* Clock controller */
#define MVIO                 (*(MVIO_t *) 0x0100) /* Multi-Voltage I/O */
#define WDT                   (*(WDT_t *) 0x0110) /* Watchdog Timer */
#define CPUINT             (*(CPUINT_t *) 0x0120) /* Interrupt Controller */
#define CRCSCAN           (*(CRCSCAN_t *) 0x0130) /* CRCSCAN */
#define RTC                   (*(RTC_t *) 0x0140) /* Real-Time Counter */
#define CCL                   (*(CCL_t *) 0x01C0) /* Configurable Custom Logic */
#define EVSYS               (*(EVSYS_t *) 0x0200) /* Event System */
#define PORTA                (*(PORT_t *) 0x0400) /* I/O Ports */
#define PORTC                (*(PORT_t *) 0x0440) /* I/O Ports */
#define PORTD                (*(PORT_t *) 0x0460) /* I/O Ports */
#define PORTF                (*(PORT_t *) 0x04A0) /* I/O Ports */
#define PORTMUX           (*(PORTMUX_t *) 0x05E0) /* Port Multiplexer */
#define ADC0                  (*(ADC_t *) 0x0600) /* Analog to Digital Converter */
#define ADC1                  (*(ADC_t *) 0x0640) /* Analog to Digital Converter */
#define AC0                    (*(AC_t *) 0x0680) /* Analog Comparator */
#define AC1                    (*(AC_t *) 0x0688) /* Analog Comparator */
#define AC2                    (*(AC_t *) 0x0690) /* Analog Comparator */
#define DAC0                  (*(DAC_t *) 0x06A0) /* Digital to Analog Converter */
#define ZCD0                  (*(ZCD_t *) 0x06C0) /* Zero Cross Detect */
#define ZCD3                  (*(ZCD_t *) 0x06D8) /* Zero Cross Detect */
#define USART0              (*(USART_t *) 0x0800) /* Universal Synchronous and Asynchronous Receiver and Transmitter */
#define USART1              (*(USART_t *) 0x0820) /* Universal Synchronous and Asynchronous Receiver and Transmitter */
#define USART2              (*(USART_t *) 0x0840) /* Universal Synchronous and Asynchronous Receiver and Transmitter */
#define TWI0                  (*(TWI_t *) 0x0900) /* Two-Wire Interface */
#define SPI0                  (*(SPI_t *) 0x0940) /* Serial Peripheral Interface */
#define SPI1                  (*(SPI_t *) 0x0960) /* Serial Peripheral Interface */
#define TCA0                  (*(TCA_t *) 0x0A00) /* 16-bit Timer/Counter Type A */
#define TCB0                  (*(TCB_t *) 0x0B00) /* 16-bit Timer Type B */
#define TCB1                  (*(TCB_t *) 0x0B10) /* 16-bit Timer Type B */
#define TCB2                  (*(TCB_t *) 0x0B20) /* 16-bit Timer Type B */
#define TCB3                  (*(TCB_t *) 0x0B30) /* 16-bit Timer Type B */
#define TCD0                  (*(TCD_t *) 0x0B80) /* Timer Counter D */
#define SWDT                 (*(SWDT_t *) 0x0E20) /* Synchronous Watchdog Timer */
#define RAMCTRL           (*(RAMCTRL_t *) 0x0E30) /* RAM Controller */
#define ERRCTRL           (*(ERRCTRL_t *) 0x0E40) /* Error Controller */
#define SYSCFG             (*(SYSCFG_t *) 0x0F00) /* System Configuration Registers */
#define NVMCTRL           (*(NVMCTRL_t *) 0x1000) /* Non-volatile Memory Controller */
#define LOCK                 (*(LOCK_t *) 0x1040) /* Lockbits */
#define FUSE                 (*(FUSE_t *) 0x1050) /* Fuses */
#define SIGROW             (*(SIGROW_t *) 0x1080) /* Signature row */
#define BOOTROW           (*(BOOTROW_t *) 0x1100) /* Boot Row */
#define USERROW           (*(USERROW_t *) 0x1200) /* User Row */

#endif /* !defined (__ASSEMBLER__) */


/* ========== Flattened fully qualified IO register names ========== */


/* VPORT (VPORTA) - Virtual Ports */
#define VPORTA_DIR  _SFR_MEM8(0x0000)
#define VPORTA_OUT  _SFR_MEM8(0x0001)
#define VPORTA_IN  _SFR_MEM8(0x0002)
#define VPORTA_INTFLAGS  _SFR_MEM8(0x0003)


