avrdudes/avr-libc/include/avr/ioavr32sd28.h
/* TCA (TCA0) - 16-bit Timer/Counter Type A - Split Mode */
#define TCA0_SPLIT_CTRLA  _SFR_MEM8(0x0A00)
#define TCA0_SPLIT_CTRLB  _SFR_MEM8(0x0A01)
#define TCA0_SPLIT_CTRLC  _SFR_MEM8(0x0A02)
#define TCA0_SPLIT_CTRLD  _SFR_MEM8(0x0A03)
#define TCA0_SPLIT_CTRLECLR  _SFR_MEM8(0x0A04)
#define TCA0_SPLIT_CTRLESET  _SFR_MEM8(0x0A05)
#define TCA0_SPLIT_INTCTRL  _SFR_MEM8(0x0A0A)
#define TCA0_SPLIT_INTFLAGS  _SFR_MEM8(0x0A0B)
#define TCA0_SPLIT_DBGCTRL  _SFR_MEM8(0x0A0E)
#define TCA0_SPLIT_LCNT  _SFR_MEM8(0x0A20)
#define TCA0_SPLIT_HCNT  _SFR_MEM8(0x0A21)
#define TCA0_SPLIT_LPER  _SFR_MEM8(0x0A26)
#define TCA0_SPLIT_HPER  _SFR_MEM8(0x0A27)
#define TCA0_SPLIT_LCMP0  _SFR_MEM8(0x0A28)
#define TCA0_SPLIT_HCMP0  _SFR_MEM8(0x0A29)
#define TCA0_SPLIT_LCMP1  _SFR_MEM8(0x0A2A)
#define TCA0_SPLIT_HCMP1  _SFR_MEM8(0x0A2B)
#define TCA0_SPLIT_LCMP2  _SFR_MEM8(0x0A2C)
#define TCA0_SPLIT_HCMP2  _SFR_MEM8(0x0A2D)


/* TCB (TCB0) - 16-bit Timer Type B */
#define TCB0_CTRLA  _SFR_MEM8(0x0B00)
#define TCB0_CTRLB  _SFR_MEM8(0x0B01)
#define TCB0_EVCTRL  _SFR_MEM8(0x0B04)
#define TCB0_INTCTRL  _SFR_MEM8(0x0B05)
#define TCB0_INTFLAGS  _SFR_MEM8(0x0B06)
#define TCB0_STATUS  _SFR_MEM8(0x0B07)
#define TCB0_DBGCTRL  _SFR_MEM8(0x0B08)
#define TCB0_TEMP  _SFR_MEM8(0x0B09)
#define TCB0_CNT  _SFR_MEM16(0x0B0A)
#define TCB0_CNTL  _SFR_MEM8(0x0B0A)
#define TCB0_CNTH  _SFR_MEM8(0x0B0B)
#define TCB0_CCMP  _SFR_MEM16(0x0B0C)
#define TCB0_CCMPL  _SFR_MEM8(0x0B0C)
#define TCB0_CCMPH  _SFR_MEM8(0x0B0D)


/* TCB (TCB1) - 16-bit Timer Type B */
#define TCB1_CTRLA  _SFR_MEM8(0x0B10)
#define TCB1_CTRLB  _SFR_MEM8(0x0B11)
#define TCB1_EVCTRL  _SFR_MEM8(0x0B14)
#define TCB1_INTCTRL  _SFR_MEM8(0x0B15)
#define TCB1_INTFLAGS  _SFR_MEM8(0x0B16)
#define TCB1_STATUS  _SFR_MEM8(0x0B17)
#define TCB1_DBGCTRL  _SFR_MEM8(0x0B18)
#define TCB1_TEMP  _SFR_MEM8(0x0B19)
#define TCB1_CNT  _SFR_MEM16(0x0B1A)
#define TCB1_CNTL  _SFR_MEM8(0x0B1A)
#define TCB1_CNTH  _SFR_MEM8(0x0B1B)
#define TCB1_CCMP  _SFR_MEM16(0x0B1C)
#define TCB1_CCMPL  _SFR_MEM8(0x0B1C)
#define TCB1_CCMPH  _SFR_MEM8(0x0B1D)


/* TCB (TCB2) - 16-bit Timer Type B */
#define TCB2_CTRLA  _SFR_MEM8(0x0B20)
#define TCB2_CTRLB  _SFR_MEM8(0x0B21)
#define TCB2_EVCTRL  _SFR_MEM8(0x0B24)
#define TCB2_INTCTRL  _SFR_MEM8(0x0B25)
#define TCB2_INTFLAGS  _SFR_MEM8(0x0B26)
#define TCB2_STATUS  _SFR_MEM8(0x0B27)
#define TCB2_DBGCTRL  _SFR_MEM8(0x0B28)
#define TCB2_TEMP  _SFR_MEM8(0x0B29)
#define TCB2_CNT  _SFR_MEM16(0x0B2A)
#define TCB2_CNTL  _SFR_MEM8(0x0B2A)
#define TCB2_CNTH  _SFR_MEM8(0x0B2B)
#define TCB2_CCMP  _SFR_MEM16(0x0B2C)
#define TCB2_CCMPL  _SFR_MEM8(0x0B2C)
#define TCB2_CCMPH  _SFR_MEM8(0x0B2D)


/* TCB (TCB3) - 16-bit Timer Type B */
#define TCB3_CTRLA  _SFR_MEM8(0x0B30)
#define TCB3_CTRLB  _SFR_MEM8(0x0B31)
#define TCB3_EVCTRL  _SFR_MEM8(0x0B34)
#define TCB3_INTCTRL  _SFR_MEM8(0x0B35)
#define TCB3_INTFLAGS  _SFR_MEM8(0x0B36)
#define TCB3_STATUS  _SFR_MEM8(0x0B37)
#define TCB3_DBGCTRL  _SFR_MEM8(0x0B38)
#define TCB3_TEMP  _SFR_MEM8(0x0B39)
#define TCB3_CNT  _SFR_MEM16(0x0B3A)
#define TCB3_CNTL  _SFR_MEM8(0x0B3A)
#define TCB3_CNTH  _SFR_MEM8(0x0B3B)
#define TCB3_CCMP  _SFR_MEM16(0x0B3C)
#define TCB3_CCMPL  _SFR_MEM8(0x0B3C)
#define TCB3_CCMPH  _SFR_MEM8(0x0B3D)


/* TCD (TCD0) - Timer Counter D */
#define TCD0_CTRLA  _SFR_MEM8(0x0B80)
#define TCD0_CTRLB  _SFR_MEM8(0x0B81)
#define TCD0_CTRLC  _SFR_MEM8(0x0B82)
#define TCD0_CTRLD  _SFR_MEM8(0x0B83)
#define TCD0_CTRLE  _SFR_MEM8(0x0B84)
#define TCD0_EVCTRLA  _SFR_MEM8(0x0B88)
#define TCD0_EVCTRLB  _SFR_MEM8(0x0B89)
#define TCD0_INTCTRL  _SFR_MEM8(0x0B8C)
#define TCD0_INTFLAGS  _SFR_MEM8(0x0B8D)
#define TCD0_STATUS  _SFR_MEM8(0x0B8E)
#define TCD0_INPUTCTRLA  _SFR_MEM8(0x0B90)
#define TCD0_INPUTCTRLB  _SFR_MEM8(0x0B91)
#define TCD0_FAULTCTRL  _SFR_MEM8(0x0B92)
#define TCD0_DLYCTRL  _SFR_MEM8(0x0B94)
#define TCD0_DLYVAL  _SFR_MEM8(0x0B95)
#define TCD0_DITCTRL  _SFR_MEM8(0x0B98)
#define TCD0_DITVAL  _SFR_MEM8(0x0B99)
#define TCD0_DBGCTRL  _SFR_MEM8(0x0B9E)
#define TCD0_CAPTUREA  _SFR_MEM16(0x0BA2)
#define TCD0_CAPTUREAL  _SFR_MEM8(0x0BA2)
#define TCD0_CAPTUREAH  _SFR_MEM8(0x0BA3)
#define TCD0_CAPTUREB  _SFR_MEM16(0x0BA4)
#define TCD0_CAPTUREBL  _SFR_MEM8(0x0BA4)
#define TCD0_CAPTUREBH  _SFR_MEM8(0x0BA5)
#define TCD0_CMPASET  _SFR_MEM16(0x0BA8)
#define TCD0_CMPASETL  _SFR_MEM8(0x0BA8)
#define TCD0_CMPASETH  _SFR_MEM8(0x0BA9)
#define TCD0_CMPACLR  _SFR_MEM16(0x0BAA)
#define TCD0_CMPACLRL  _SFR_MEM8(0x0BAA)
#define TCD0_CMPACLRH  _SFR_MEM8(0x0BAB)
#define TCD0_CMPBSET  _SFR_MEM16(0x0BAC)
#define TCD0_CMPBSETL  _SFR_MEM8(0x0BAC)
#define TCD0_CMPBSETH  _SFR_MEM8(0x0BAD)
#define TCD0_CMPBCLR  _SFR_MEM16(0x0BAE)
#define TCD0_CMPBCLRL  _SFR_MEM8(0x0BAE)
#define TCD0_CMPBCLRH  _SFR_MEM8(0x0BAF)


/* SWDT - Synchronous Watchdog Timer */
#define SWDT_CTRLA  _SFR_MEM8(0x0E20)
#define SWDT_CTRLB  _SFR_MEM8(0x0E21)
#define SWDT_INTCTRL  _SFR_MEM8(0x0E22)
#define SWDT_INTFLAGS  _SFR_MEM8(0x0E23)
#define SWDT_CNT  _SFR_MEM32(0x0E24)
#define SWDT_CNT0  _SFR_MEM8(0x0E24)
#define SWDT_CNT1  _SFR_MEM8(0x0E25)
#define SWDT_CNT2  _SFR_MEM8(0x0E26)
#define SWDT_CNT3  _SFR_MEM8(0x0E27)
#define SWDT_RESET  _SFR_MEM32(0x0E28)
#define SWDT_RESET0  _SFR_MEM8(0x0E28)
#define SWDT_RESET1  _SFR_MEM8(0x0E29)
#define SWDT_RESET2  _SFR_MEM8(0x0E2A)
#define SWDT_RESET3  _SFR_MEM8(0x0E2B)
#define SWDT_WINDOW  _SFR_MEM16(0x0E2C)
#define SWDT_WINDOWL  _SFR_MEM8(0x0E2C)
#define SWDT_WINDOWH  _SFR_MEM8(0x0E2D)
#define SWDT_COMMAND  _SFR_MEM8(0x0E2E)


/* RAMCTRL - RAM Controller */
#define RAMCTRL_CTRLA  _SFR_MEM8(0x0E30)
#define RAMCTRL_INTFLAGS  _SFR_MEM8(0x0E31)
#define RAMCTRL_ADDR  _SFR_MEM16(0x0E32)
#define RAMCTRL_ADDRL  _SFR_MEM8(0x0E32)
#define RAMCTRL_ADDRH  _SFR_MEM8(0x0E33)
#define RAMCTRL_SYNDROME  _SFR_MEM8(0x0E34)


/* ERRCTRL - Error Controller */
#define ERRCTRL_CTRLA  _SFR_MEM8(0x0E40)
#define ERRCTRL_STATUSA  _SFR_MEM8(0x0E41)
#define ERRCTRL_TIMEOUT  _SFR_MEM8(0x0E42)
#define ERRCTRL_TIMECNT  _SFR_MEM8(0x0E43)
#define ERRCTRL_CAUSE  _SFR_MEM8(0x0E44)
#define ERRCTRL_ESCVREGFAIL  _SFR_MEM8(0x0E50)
#define ERRCTRL_ESCBUSERR  _SFR_MEM8(0x0E51)
#define ERRCTRL_ESCRAM2  _SFR_MEM8(0x0E52)
#define ERRCTRL_ESCFLASH2  _SFR_MEM8(0x0E53)
#define ERRCTRL_ESCOPC  _SFR_MEM8(0x0E54)
#define ERRCTRL_ESCSPLIM  _SFR_MEM8(0x0E55)
#define ERRCTRL_ESCRAM1  _SFR_MEM8(0x0E56)
#define ERRCTRL_ESCFLASH1  _SFR_MEM8(0x0E57)
#define ERRCTRL_ESCVREGWARN  _SFR_MEM8(0x0E58)
#define ERRCTRL_ESCCFD0  _SFR_MEM8(0x0E59)
#define ERRCTRL_ESCCFD1  _SFR_MEM8(0x0E5A)
#define ERRCTRL_ESCCFM0  _SFR_MEM8(0x0E5B)
#define ERRCTRL_ESCCFM1  _SFR_MEM8(0x0E5C)
#define ERRCTRL_ESCSWDT  _SFR_MEM8(0x0E5D)
#define ERRCTRL_ESCEEPROM  _SFR_MEM8(0x0E5E)
#define ERRCTRL_ESCEVSYS0  _SFR_MEM8(0x0E5F)
#define ERRCTRL_ESCEVSYS1  _SFR_MEM8(0x0E60)
#define ERRCTRL_ESF  _SFR_MEM32(0x0E70)
#define ERRCTRL_ESF0  _SFR_MEM8(0x0E70)
#define ERRCTRL_ESF1  _SFR_MEM8(0x0E71)
#define ERRCTRL_ESF2  _SFR_MEM8(0x0E72)
#define ERRCTRL_ESF3  _SFR_MEM8(0x0E73)
#define ERRCTRL_ESFTEST  _SFR_MEM32(0x0E74)
#define ERRCTRL_ESFTEST0  _SFR_MEM8(0x0E74)
#define ERRCTRL_ESFTEST1  _SFR_MEM8(0x0E75)
#define ERRCTRL_ESFTEST2  _SFR_MEM8(0x0E76)
#define ERRCTRL_ESFTEST3  _SFR_MEM8(0x0E77)


